PureEngineering/PUREmodules/nrf52/modules_examples/dwm1000_test/main.c
/*
void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
}



uint8_t spiRead(uint8_t* rx_data,uint8_t* length)
{
    
    //uint8_t address = addr & 0x7F;
    uint8_t tx_data[SPI_MAX_LENGTH];
    uint8_t rx_length = *length;
    spi_xfer_done = false;

    if(length == 0){
        return TRANSFER_OK;
    }

    if (rx_length > SPI_MAX_LENGTH){
        return TRANSFER_ERR;
    }

    memset(tx_data, 0xff,rx_length);

    spi_xfer_done = false;

    APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, tx_data, rx_length, rx_data, rx_length));


    while (!spi_xfer_done)
    {
        __WFE();
    }

    return TRANSFER_OK;
}



int SPI_waitforRX(uint8_t* data, uint16_t* length, uint16_t exp_length){
    uint8_t lengthble = 32;
    uint8_t *ble_string[lengthble];
    uint8_t len_header = 1;
    uint8_t header[len_header];
    memset(header,0,len_header);
    
    sprintf((char *)ble_string, "inside wait \r\n");
    send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);

    while(header[0]==0x00){
      spiRead(header,&len_header);
    }

    *length = 0;
    spiRead(data, header);
    *length += header[0];


    sprintf((char *)ble_string, "length: %d expected: %d \r\n",*length, exp_length);
    send_ble_data2(m_nus,(uint8_t *)ble_string,lengthble);

    return -1;

}


uint8_t spiWrite(ble_nus_t m_nus, uint8_t* tx_data,uint8_t* length)
{
    //uint8_t address = addr | 0x80;
    uint8_t rx_data[SPI_MAX_LENGTH];
    uint8_t tx_length = *length;
    //uint16_t str_len = 0;


    uint8_t lengthble = 15;
    uint8_t *ble_string[lengthble];



    if(tx_length == 0){
        return TRANSFER_OK;
    }

    if(tx_length > SPI_MAX_LENGTH){
        return TRANSFER_ERR;
    }

    spi_xfer_done = false;

    sprintf((char *)ble_string, "before write \r\n");
    send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);


    APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, tx_data, tx_length, rx_data, tx_length));


    sprintf((char *)ble_string, "after write %d \r\n",spi_xfer_done);
    send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);

    //while (!spi_xfer_done)
    //{
    //    __WFE();
    //}



    sprintf((char *)ble_string, "return  \r\n");
    send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);
    return TRANSFER_OK;
}*/


/**
 * @brief TWI master instance
 *
 * Instance of TWI master driver that would be used for communication with simulated
 * eeprom memory.
 */
//TW0_USE_EAY added in nrf_drv_twi line 80
static const nrf_drv_twi_t m_twi_master = NRF_DRV_TWI_INSTANCE(MASTER_TWI_INST);



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
    app_uart_put(p_data[0]);
    uint8_t lengthble = 13;
    uint8_t *ble_string[lengthble];
    //Parses the input from the android app to turn on or off
    //the different sensors. 
    switch (p_data[0])
    {
        case 0x01:

            lis2de_init(m_twi_master);
            uint8_t id = lis2de_whoami(m_twi_master);
            sprintf((char *)ble_string, "lis2deid: %d \r\n",id);
            send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);
            lis2de_on = true;
            break;

        case 0x02:
            lis2de_powerdown(m_twi_master);
            lis2de_on = false;
            break;


        //NEED TO ADD TOF SENSOR


        default:
            break;
    }

    //Code to put ble received messages into uart

    /*for (uint32_t i = 0; i < length; i++)
    {       
        while (app_uart_put(p_data[i]) != NRF_SUCCESS);
    }

    while (app_uart_put('\r') != NRF_SUCCESS);
    while (app_uart_put('\n') != NRF_SUCCESS);*/
}

/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_nus_init_t nus_init;

    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

