PureEngineering/PUREmodules/nrf52/modules_examples/dwm1000_test/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 *//*
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}*/



/**
 * @brief Initialize the master TWI
 *
 * Function used to initialize master TWI interface that would communicate with simulated EEPROM.
 *
 * @return NRF_SUCCESS or the reason of failure
 */
static ret_code_t twi_master_init(void)
{
    ret_code_t ret;
    const nrf_drv_twi_config_t config =
    {
       .scl                = TWI_SCL_M,
       .sda                = TWI_SDA_M,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    ret = nrf_drv_twi_init(&m_twi_master, &config, NULL, NULL);

    if (NRF_SUCCESS == ret)
    {
        nrf_drv_twi_enable(&m_twi_master);
    }

    return ret;
}

//Code that runs in main to read data from sensors that are on
void print_to_ble(){
    if(lis2de_on){
        run_lis2de_ble(m_twi_master,m_nus);
        //dwm_gpio_cfg_output(m_nus,DWM_GPIO_IDX_13,true);
    }

}

APP_TIMER_DEF(sensor_loop_timer_id);

static void sensor_loop_handler(void * p_context)
{
   print_to_ble();  
}

static void create_sensor_timer()
{   
    uint32_t err_code;

    // Create timers
    err_code = app_timer_create(&sensor_loop_timer_id, APP_TIMER_MODE_REPEATED, sensor_loop_handler);
    APP_ERROR_CHECK(err_code);

     err_code = app_timer_start(sensor_loop_timer_id, APP_TIMER_TICKS(3000, APP_TIMER_PRESCALER), NULL);
     APP_ERROR_CHECK(err_code);
}







/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    /* Initializing TWI master interface for SuperSensor */
    err_code = twi_master_init();
    APP_ERROR_CHECK(err_code);


    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);


    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    uart_init();

    //TODO:check this is initializing correctly
    dwm_init();

    //TODO:
    //bsp_board_leds_init();
    if(anchor){
        dwm_cfg_anchor_t cfg_anchor;
        dwm_cfg_t cfg_node;
        cfg_anchor.initiator = 1; 
        cfg_anchor.bridge = 0;
        cfg_anchor.common.led_en = 1;
        cfg_anchor.common.ble_en = 1;
        cfg_anchor.common.uwb_mode = DWM_UWB_MODE_OFF;
        cfg_anchor.common.fw_update_en = 1;
        dwm_cfg_anchor_set(m_nus,&cfg_anchor);
        nrf_delay_ms(2000);
        dwm_cfg_get(m_nus,&cfg_node);   
    }
    else{
        dwm_cfg_tag_t cfg_tag;
        dwm_cfg_t cfg_node;
        cfg_tag.low_power_en = 0; 
        cfg_tag.meas_mode = DWM_MEAS_MODE_TWR;
        cfg_tag.loc_engine_en = 1;
        cfg_tag.common.led_en = 1;
        cfg_tag.common.ble_en = 1;
        cfg_tag.common.uwb_mode = DWM_UWB_MODE_ACTIVE;
        cfg_tag.common.fw_update_en = 0;
        dwm_cfg_tag_set(m_nus,&cfg_tag);
        nrf_delay_ms(2000);
        dwm_cfg_get(m_nus,&cfg_node);
    }


    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);


    NRF_LOG_FLUSH();

    create_sensor_timer();


    //SPI setup
    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = SPI_SS_PIN;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin  = SPI_SCK_PIN;

    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));


    dwm_loc_data_t loc;
    dwm_pos_t pos;
    loc.p_pos = &pos;
    uint8_t lengthble = 31;
    uint8_t *ble_string[lengthble];


    // Enter main loop.
    for (;;)
    {
	   err_code = sd_app_evt_wait();
	   APP_ERROR_CHECK(err_code);
       nrf_delay_ms(1000);

        if(dwm_loc_get(m_nus,&loc) == RV_OK)
          {
            //HAL_Print("\t[%d,%d,%d,%u]\n", loc.p_pos->x, loc.p_pos->y, loc.p_pos->z,loc.p_pos->qf);

            sprintf((char *)ble_string, "\t[%lu,%lu,%lu,%u]\n",loc.p_pos->x, loc.p_pos->y, loc.p_pos->z,loc.p_pos->qf);
            send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);


            for (int i = 0; i < loc.anchors.dist.cnt; ++i) 
            {
                //HAL_Print("\t%u)", i);
                sprintf((char *)ble_string, "\t%u)",i);
                send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);

                //HAL_Print("0x%llx", loc.anchors.dist.addr[i]);
                sprintf((char *)ble_string, "0x%llx", loc.anchors.dist.addr[i]);
                send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);


                if (i < loc.anchors.an_pos.cnt) 
                {
                   //HAL_Print("[%d,%d,%d,%u]", loc.anchors.an_pos.pos[i].x,
                    //     loc.anchors.an_pos.pos[i].y,
                    //     loc.anchors.an_pos.pos[i].z,
                    //     loc.anchors.an_pos.pos[i].qf);

                    sprintf((char *)ble_string, "[%lu,%lu,%lu,%u]", loc.anchors.an_pos.pos[i].x,
                         loc.anchors.an_pos.pos[i].y,
                         loc.anchors.an_pos.pos[i].z,
                         loc.anchors.an_pos.pos[i].qf);
                    send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);


                }
                //HAL_Print("=%u,%u\n", loc.anchors.dist.dist[i], loc.anchors.dist.qf[i]);
                sprintf((char *)ble_string, "=%lu,%u\n", loc.anchors.dist.dist[i], loc.anchors.dist.qf[i]);
                send_ble_data(m_nus,(uint8_t *)ble_string,lengthble);
                }
            }
    }
    return 0;
}


/**
 * @}
 */
